ndrs-pst/zephyr_rtos/drivers/sdhc/sdhc_stm32_v2.c
/*
 * Copyright (c) 2024 STMicroelectronics
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT st_stm32_sdhc_v2

#include <zephyr/kernel.h>
#include <zephyr/drivers/disk.h>
#include <zephyr/drivers/sdhc.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/reset.h>
#include <zephyr/logging/log.h>
#include <zephyr/irq.h>
#include <zephyr/sys/byteorder.h>
#include <soc.h>

/* STM32 includes */
#include <stm32_ll_rcc.h>
#include <stm32_ll_sdmmc.h>

LOG_MODULE_REGISTER(stm32_sdhc, CONFIG_SDHC_LOG_LEVEL);

#include <zephyr/drivers/gpio.h>
extern struct gpio_dt_spec const g_dbg_pin_gpio_dt[];
#define DBG_PIN_SET(n, state) \
	gpio_pin_set_raw_dt(&g_dbg_pin_gpio_dt[(n)], (state))

// #define STM32_SDHC_USE_DMA DT_NODE_HAS_PROP(DT_DRV_INST(0), dmas)
#define STM32_SDHC_USE_DMA      0

#if STM32_SDHC_USE_DMA
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_stm32.h>
#include <stm32_ll_dma.h>
#endif

#if STM32_SDHC_USE_DMA

static const uint32_t sdhc_stm32_dma_tbl_pri[] = {
	DMA_PRIORITY_LOW,
	DMA_PRIORITY_MEDIUM,
	DMA_PRIORITY_HIGH,
	DMA_PRIORITY_VERY_HIGH
};

struct sdhc_dma_stream {
	const struct device *dev;
	uint32_t channel;
	uint32_t channel_nb;
	DMA_TypeDef *reg;
	struct dma_config cfg;
};
#endif

struct sdhc_stm32_config {
	void (*irq_config)(const struct device *dev);
	struct gpio_dt_spec cd_gpio;
	struct gpio_dt_spec pwr_gpio;
	const struct stm32_pclken *pclken; /* clock subsystem driving this peripheral */
	size_t pclk_len;                   /* number of clock subsystems */
	const struct pinctrl_dev_config *pcfg;
	const struct reset_dt_spec reset;

	bool use_dma;

	struct sdhc_host_props props;
};

struct sdhc_stm32_data {
	const struct device *dev;
	SDMMC_TypeDef *sdmmc;
	struct sdhc_io host_io;
	struct k_sem sync;
	struct k_work cd_work;
	struct k_work sdio_work;
	struct gpio_callback cd_cb;

	uint32_t ops_sts;
	uint32_t card_sts;
	uint32_t xfer_ctx;
	uint32_t prev_opcode;

	bool use_dma;
	bool card_present;

	uint8_t *tx_buffer;
	size_t tx_xfer_sz;

	uint8_t *rx_buffer;
	size_t rx_xfer_sz;

	sdhc_interrupt_cb_t sdhc_cb;
	void *sdhc_cb_user_data;
	int sdhc_int_sources;

	uint8_t io_int_num;
	uint8_t io_func_msk;
	uint8_t opr_cnt;
};

static int sdhc_stm32_clock_enable(const struct sdhc_stm32_config *cfg)
{
	const struct device *clock;

	/* HSI48 Clock is enabled through using the device tree */
	clock = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	if (cfg->pclk_len > 1) {
		if (clock_control_configure(clock,
					    (clock_control_subsys_t)&cfg->pclken[1],
					    NULL) != 0) {
			LOG_ERR("Failed to enable SDHC domain clock");
			return -EIO;
		}
	}

	if (IS_ENABLED(CONFIG_SDHC_STM32_CLOCK_CHECK)) {
		uint32_t sdhc_clock_rate;

		if (clock_control_get_rate(clock,
					   (clock_control_subsys_t)&cfg->pclken[1],
					   &sdhc_clock_rate) != 0) {
			LOG_ERR("Failed to get SDHC domain clock rate");
			return -EIO;
		}

		if (sdhc_clock_rate != MHZ(48)) {
			LOG_ERR("SDHC Clock is not 48MHz (%d)", sdhc_clock_rate);
			return -ENOTSUP;
		}
	}

	/* Enable the APB clock for stm32_sdhc */
	return clock_control_on(clock, (clock_control_subsys_t)&cfg->pclken[0]);
}

static int sdhc_stm32_clock_disable(const struct sdhc_stm32_config *config)
{
	const struct device *clock;

	clock = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);

	return clock_control_off(clock,
				 (clock_control_subsys_t)&config->pclken);
}

#if STM32_SDHC_USE_DMA

static void sdhc_stm32_dma_cb(const struct device *dev, void *arg, uint32_t channel, int status)
{
	DMA_HandleTypeDef *hdma = arg;

	if (status != 0) {
		LOG_ERR("DMA callback error with channel %d.", channel);
	}

	HAL_DMA_IRQHandler(hdma);
}

static int sdhc_stm32_configure_dma(DMA_HandleTypeDef *handle, struct sdhc_dma_stream *dma)
{
	int ret;

	if (!device_is_ready(dma->dev)) {
		LOG_ERR("Failed to get dma dev");
		return -ENODEV;
	}

	dma->cfg.user_data = handle;

	ret = dma_config(dma->dev, dma->channel, &dma->cfg);
	if (ret != 0) {
		LOG_ERR("Failed to conig");
		return ret;
	}

	handle->Instance = __LL_DMA_GET_STREAM_INSTANCE(dma->reg, dma->channel_nb);
	// FIXME handle->Init.Channel             = dma->cfg.dma_slot * DMA_CHANNEL_1;
	handle->Init.PeriphInc = DMA_PINC_DISABLE;
	handle->Init.MemInc = DMA_MINC_ENABLE;
	handle->Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
	handle->Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
	handle->Init.Mode = DMA_PFCTRL;
	// FIXME handle->Init.Priority            = table_priority[dma->cfg.channel_priority],
	handle->Init.FIFOMode = DMA_FIFOMODE_ENABLE;
	handle->Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
	handle->Init.MemBurst = DMA_MBURST_INC4;
	handle->Init.PeriphBurst = DMA_PBURST_INC4;

	return ret;
}

static int sdhc_stm32_dma_init(struct sdhc_stm32_data *data)
{
	int err;

	LOG_DBG("using dma");

	err = sdhc_stm32_configure_dma(&data->dma_tx_handle, &data->dma_tx);
	if (err) {
		LOG_ERR("failed to init tx dma");
		return err;
	}
	__HAL_LINKDMA(&data->hsd, hdmatx, data->dma_tx_handle);
	HAL_DMA_Init(&data->dma_tx_handle);

	err = sdhc_stm32_configure_dma(&data->dma_rx_handle, &data->dma_rx);
	if (err) {
		LOG_ERR("failed to init rx dma");
		return err;
	}
	__HAL_LINKDMA(&data->hsd, hdmarx, data->dma_rx_handle);
	HAL_DMA_Init(&data->dma_rx_handle);

	return err;
}

static int sdhc_stm32_dma_deinit(struct sdhc_stm32_data *data)
{
	int ret;
	struct sdmmc_dma_stream *dma_tx = &data->dma_tx;
	struct sdmmc_dma_stream *dma_rx = &data->dma_rx;

	ret = dma_stop(dma_tx->dev, dma_tx->channel);
	HAL_DMA_DeInit(&data->dma_tx_handle);
	if (ret != 0) {
		LOG_ERR("Failed to stop tx DMA transmission");
		return ret;
	}
	ret = dma_stop(dma_rx->dev, dma_rx->channel);
	HAL_DMA_DeInit(&data->dma_rx_handle);
	if (ret != 0) {
		LOG_ERR("Failed to stop rx DMA transmission");
		return ret;
	}
	return ret;
}
#endif

static uint8_t sdhc_stm32_cnv_blk_sz(uint32_t blk_sz)
{
	uint8_t most_bit = (uint8_t)__CLZ(__RBIT(blk_sz));

