ndrs-pst/zephyr_rtos/drivers/sdhc/sdhc_stm32_v2.c
	/* (1 << most_bit) - 1) is the mask used for blocksize */
	if (((uint8_t)blk_sz & ((1U << most_bit) - 1U)) != 0U) {
		return (uint8_t)SDMMC_DATABLOCK_SIZE_4B;
	}

	return most_bit << SDMMC_DCTRL_DBLOCKSIZE_Pos;
}

static int sdhc_stm32_get_cmd_err(SDMMC_TypeDef *sdmmc, int timeout_ms) {

	while (true) {
		if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CMDSENT)) {
			break;
		}

		k_msleep(1);
		if (timeout_ms-- <= 0) {
			return -ETIMEDOUT;
		}
	}

	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_CMD_FLAGS);

	return 0;
}

static int sdhc_stm32_get_resp_wait(SDMMC_TypeDef *sdmmc, int timeout_ms, uint32_t wait_flg) {
	uint32_t sta_reg;
	int timeout_us = 1000;

	/* Busy waiting for the first 1 ms in the hope that we will get the response */
	while (timeout_us-- > 0) {
		sta_reg = sdmmc->STA;

		if (((sta_reg & wait_flg) != 0U) &&
		    ((sta_reg & SDMMC_FLAG_CMDACT) == 0U)) {
			return 0;
		}

		k_busy_wait(1);
	}
	/* First 1 ms is already spent */
	timeout_ms--;

	/* Since the first 1 ms is not successful, switch to wait in 1 ms each instead */
	while (timeout_ms-- > 0) {
		sta_reg = sdmmc->STA;

		if (((sta_reg & wait_flg) != 0U) &&
		    ((sta_reg & SDMMC_FLAG_CMDACT) == 0U)) {
			return 0;
		}

		k_msleep(1);
	}

	return -ETIMEDOUT;
}

static int sdhc_stm32_get_resp1_ll(SDMMC_TypeDef *sdmmc, int timeout_ms, uint32_t opcode)
{
	int ret;

	ret = sdhc_stm32_get_resp_wait(sdmmc, timeout_ms,
				       (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND |
					SDMMC_FLAG_CTIMEOUT | SDMMC_FLAG_BUSYD0END));
	if (ret) {
		return ret;
	}

	if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CTIMEOUT)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_CTIMEOUT);
		return -ETIMEDOUT;
	} else if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CCRCFAIL)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_CCRCFAIL);
		return -EIO;
	} else {
		/* Nothing to do */
	}

	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_CMD_FLAGS);

	/* Check response received is of desired command (only when SD_RSP_TYPE_R1) */
	if (SDMMC_GetCommandResponse(sdmmc) != (uint8_t)opcode) {
		return -EIO;
	}

	return 0;
}

static int sdhc_stm32_get_resp2_ll(SDMMC_TypeDef *sdmmc, int timeout_ms)
{
	int ret;

	ret = sdhc_stm32_get_resp_wait(sdmmc, timeout_ms,
				       (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND |
					SDMMC_FLAG_CTIMEOUT));
	if (ret) {
		return ret;
	}

	if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CTIMEOUT)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_CTIMEOUT);
		return -ETIMEDOUT;
	} else if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CCRCFAIL)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_CCRCFAIL);
		return -EIO;
	} else {
		/* Clear all the static flags */
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_CMD_FLAGS);
	}

	return 0;
}

static int sdhc_stm32_get_resp3_ll(SDMMC_TypeDef *sdmmc, int timeout_ms)
{
	int ret;

	ret = sdhc_stm32_get_resp_wait(sdmmc, timeout_ms,
				       (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND |
					SDMMC_FLAG_CTIMEOUT));
	if (ret) {
		return ret;
	}

	if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CTIMEOUT)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_CTIMEOUT);
		return -ETIMEDOUT;
	}

	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_CMD_FLAGS);

	return 0;
}

static int sdhc_stm32_get_resp6_ll(SDMMC_TypeDef *sdmmc, int timeout_ms, uint32_t opcode)
{
	int ret;

	ret = sdhc_stm32_get_resp_wait(sdmmc, timeout_ms,
				       (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND |
					SDMMC_FLAG_CTIMEOUT));
	if (ret) {
		return ret;
	}

	if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CTIMEOUT)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_CTIMEOUT);
		return -ETIMEDOUT;
	} else if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CCRCFAIL)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_CCRCFAIL);
		return -EIO;
	} else {
		/* pass */
	}

	/* Check response received is of desired command (only when SD_RSP_TYPE_R1) */
	if (SDMMC_GetCommandResponse(sdmmc) != (uint8_t)opcode) {
		return -EIO;
	}

	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_CMD_FLAGS);

	return 0;
}

static int sdhc_stm32_get_resp7_ll(SDMMC_TypeDef *sdmmc, int timeout_ms)
{
	int ret;

	ret = sdhc_stm32_get_resp_wait(sdmmc, timeout_ms,
				       (SDMMC_FLAG_CCRCFAIL | SDMMC_FLAG_CMDREND |
					SDMMC_FLAG_CTIMEOUT));
	if (ret) {
		return ret;
	}

	if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CTIMEOUT)) {
		/* Card is not SD V2.0 compliant */
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_CTIMEOUT);
		return -ETIMEDOUT;
	} else if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CCRCFAIL)) {
		/* Card is not SD V2.0 compliant */
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_CCRCFAIL);
		return -EIO;
	} else {
		/* pass */
	}

	if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_CMDREND)) {
		/* Card is SD V2.0 compliant */
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_CMDREND);
	}

	return 0;
}

static int sdhc_stm32_get_resp(SDMMC_TypeDef *sdmmc, struct sdhc_command *cmd)
{
	int ret;
	enum sd_rsp_type rsp_type;

	rsp_type = (cmd->response_type & SDHC_NATIVE_RESPONSE_MASK);
	switch (rsp_type) {
	case SD_RSP_TYPE_NONE:
		ret = sdhc_stm32_get_cmd_err(sdmmc, cmd->timeout_ms);
		break;

	case SD_RSP_TYPE_R1:
	case SD_RSP_TYPE_R1b:
	case SD_RSP_TYPE_R5:
		ret = sdhc_stm32_get_resp1_ll(sdmmc, cmd->timeout_ms, cmd->opcode);
		if (ret == 0) {
			cmd->response[0] = sdmmc->RESP1;
		}
		break;

	case SD_RSP_TYPE_R2:
		ret = sdhc_stm32_get_resp2_ll(sdmmc, cmd->timeout_ms);
		if (ret == 0) {
			cmd->response[0] = sdmmc->RESP1;
			cmd->response[1] = sdmmc->RESP2;
			cmd->response[2] = sdmmc->RESP3;
			cmd->response[3] = sdmmc->RESP4;
		}
		break;

	case SD_RSP_TYPE_R3:
	case SD_RSP_TYPE_R4:
		ret = sdhc_stm32_get_resp3_ll(sdmmc, cmd->timeout_ms);
		if (ret == 0) {
			cmd->response[0] = sdmmc->RESP1;
		}
		break;

	case SD_RSP_TYPE_R6:
		ret = sdhc_stm32_get_resp6_ll(sdmmc, cmd->timeout_ms, cmd->opcode);
		if (ret == 0) {
			cmd->response[0] = sdmmc->RESP1;
			if ((cmd->response[0] & (SDMMC_R6_GENERAL_UNKNOWN_ERROR | SDMMC_R6_ILLEGAL_CMD |
						 SDMMC_R6_COM_CRC_FAILED)) != 0U) {
				ret = -EIO;
			}
		}
		break;

	case SD_RSP_TYPE_R7:
		ret = sdhc_stm32_get_resp7_ll(sdmmc, cmd->timeout_ms);
		if (ret == 0) {
			cmd->response[0] = sdmmc->RESP1;
		}
		break;

	default:
		ret = -EINVAL;
		break;
	}

