ndrs-pst/zephyr_rtos/drivers/sdhc/sdhc_stm32_v2.c
	return 0;
}

static int sdhc_stm32_get_scr(SDMMC_TypeDef *sdmmc, int timeout_ms, uint8_t* scr)
{
	uint32_t tempscr[2];
	uint32_t index = 0U;
	uint32_t tickstart = HAL_GetTick();

	while (!__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DBCKEND |
					SDMMC_FLAG_DATAEND)) {
		if ((!__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_RXFIFOE)) && (index == 0U)) {
			tempscr[0] = sdmmc->FIFO;
			tempscr[1] = sdmmc->FIFO;
			index++;

			sys_put_be32(tempscr[1], scr);
			sys_put_be32(tempscr[0], scr + 4);
		}

		if ((HAL_GetTick() - tickstart) >= SDMMC_SWDATATIMEOUT) {
			return -ETIMEDOUT;
		}
	}

	if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_DTIMEOUT)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_DTIMEOUT);
		return -ETIMEDOUT;
	} else if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_DCRCFAIL)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_DCRCFAIL);
		return -EIO;
	} else if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_RXOVERR)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_RXOVERR);
		return -EIO;
	} else {
		/* Clear all the static flags */
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_DATA_FLAGS);
	}

	return 0;
}

static int sdhc_stm32_get_speed(SDMMC_TypeDef *sdmmc, int timeout_ms, uint8_t* status)
{
	uint32_t loop = 0;
	uint32_t Timeout = HAL_GetTick();

	while (!__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
					SDMMC_FLAG_DBCKEND | SDMMC_FLAG_DATAEND)) {
		if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_RXFIFOHF)) {
			for (uint32_t count = 0U; count < 8U; count++) {
				uint32_t data = sdmmc->FIFO;

				sys_put_le32(data, &status[(32U * loop) + (4 * count)]);
			}
			loop++;
		}

		if ((HAL_GetTick() - Timeout) >= SDMMC_SWDATATIMEOUT) {
			return -ETIMEDOUT;
		}
	}

	if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_DTIMEOUT)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_DTIMEOUT);
		return -ETIMEDOUT;
	} else if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_DCRCFAIL)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_DCRCFAIL);
		return -EIO;
	} else if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_RXOVERR)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_RXOVERR);
		return -EIO;
	} else {
		/* No error flag set */
	}

	/* Clear all the static flags */
	__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_DATA_FLAGS);

	return (0);
}

static int sdhc_stm32_snd_cmd(SDMMC_TypeDef *sdmmc, struct sdhc_command *cmd, uint32_t response)
{
	SDMMC_CmdInitTypeDef cmd_init;
	int ret;

	cmd_init.Argument = cmd->arg;
	cmd_init.CmdIndex = cmd->opcode;
	cmd_init.Response = response;
	cmd_init.WaitForInterrupt = SDMMC_WAIT_NO;
	cmd_init.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(sdmmc, &cmd_init);

	ret = sdhc_stm32_get_resp(sdmmc, cmd);

	return ret;
}

static int sdhc_stm32_stp_xfer(SDMMC_TypeDef *sdmmc, struct sdhc_command *cmd)
{
	SDMMC_CmdInitTypeDef cmd_init;
	int ret;

	cmd_init.Argument = cmd->arg;
	cmd_init.CmdIndex = cmd->opcode;
	cmd_init.Response = SDMMC_RESPONSE_SHORT;
	cmd_init.WaitForInterrupt = SDMMC_WAIT_NO;
	cmd_init.CPSM = SDMMC_CPSM_ENABLE;

	__SDMMC_CMDSTOP_ENABLE(sdmmc);
	__SDMMC_CMDTRANS_DISABLE(sdmmc);

	(void)SDMMC_SendCommand(sdmmc, &cmd_init);

	ret = sdhc_stm32_get_resp(sdmmc, cmd);

	__SDMMC_CMDSTOP_DISABLE(sdmmc);

	return ret;
}

static int sdhc_stm32_sdio_rw_direct(SDMMC_TypeDef *sdmmc, struct sdhc_command *cmd)
{
	SDMMC_CmdInitTypeDef cmd_init;
	int ret;

	cmd_init.Argument = cmd->arg;
	cmd_init.CmdIndex = SDMMC_CMD_SDMMC_RW_DIRECT;
	cmd_init.Response = SDMMC_RESPONSE_SHORT;
	cmd_init.WaitForInterrupt = SDMMC_WAIT_NO;
	cmd_init.CPSM = SDMMC_CPSM_ENABLE;
	(void)SDMMC_SendCommand(sdmmc, &cmd_init);

	ret = sdhc_stm32_get_resp1_ll(sdmmc, 1, SDMMC_CMD_SDMMC_RW_DIRECT);
	if (ret == 0) {
		__SDMMC_CMDTRANS_DISABLE(sdmmc);
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_DATA_FLAGS);

		cmd->response[0] = sdmmc->RESP1;
	}

	return ret;
}

static int sdhc_stm32_sdio_rd_fifo(SDMMC_TypeDef *sdmmc, void *data, uint32_t dat_len,
				   int timeout_ms)
{
	uint32_t *rx_buf32 = (uint32_t *)data;
	uint8_t *rx_buf8 = data;
	uint32_t remain_len = dat_len;
	uint32_t chk_flg = (SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
			    SDMMC_FLAG_DATAEND);

	/* Fast path for 32-bit aligned data */
	if (((uintptr_t)data & 3) == 0) {
		while (!__SDMMC_GET_FLAG(sdmmc, chk_flg)) {
			if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_RXFIFOHF) && (remain_len >= 32U)) {
				/* Direct 32-bit reads for aligned data */
				for (int i = 0; i < 8; i++) {
					*rx_buf32++ = sdmmc->FIFO;
				}
				remain_len -= 32U;
			} else if ((remain_len < 32U) && (remain_len > 0U)) {
				while (!__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_RXFIFOE) &&
				       remain_len >= 4U) {
					*rx_buf32++ = sdmmc->FIFO;
					remain_len -= 4U;
				}

				/* Handle remaining bytes */
				if (remain_len > 0U) {
					uint32_t temp = sdmmc->FIFO;
					uint8_t *last_bytes = (uint8_t *)&temp;
					for (uint32_t i = 0; i < remain_len; i++) {
						*rx_buf8++ = last_bytes[i];
					}
					remain_len = 0U;
				}
			} else {
				/* Nothing to do */
			}

			k_msleep(1);
			if (timeout_ms-- == 0) {
				return -ETIMEDOUT;
			}
		}
	} else {
		while (!__SDMMC_GET_FLAG(sdmmc, chk_flg)) {
			if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_RXFIFOHF) && (remain_len >= 32U)) {
				for (size_t cnt = 0U; cnt < 8U; cnt++) {
					uint32_t rd_fifo = sdmmc->FIFO;
					*rx_buf8 = (uint8_t)(rd_fifo & 0xFFU);
					rx_buf8++;
					*rx_buf8 = (uint8_t)((rd_fifo >> 8U) & 0xFFU);
					rx_buf8++;
					*rx_buf8 = (uint8_t)((rd_fifo >> 16U) & 0xFFU);
					rx_buf8++;
					*rx_buf8 = (uint8_t)((rd_fifo >> 24U) & 0xFFU);
					rx_buf8++;
				}
				remain_len -= 32U;
			} else if (remain_len < 32U) {
				while ((remain_len > 0U) &&
				       !(__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_RXFIFOE))) {
					uint32_t rd_fifo = sdmmc->FIFO;
					for (size_t cnt = 0U; cnt < 4U; cnt++) {
						if (remain_len > 0U) {
							*rx_buf8 =
								(uint8_t)((rd_fifo >> (cnt * 8U)) &
									  0xFFU);
							rx_buf8++;
							remain_len--;
						}
					}
				}
			} else {
				/* Nothing to do */
			}

			k_msleep(1);
			if (timeout_ms-- == 0) {
				return -ETIMEDOUT;
			}
		}
	}

