ndrs-pst/zephyr_rtos/drivers/sdhc/sdhc_stm32_v2.c
	return 0;
}

static int sdhc_stm32_sdio_wr_fifo(SDMMC_TypeDef *sdmmc, void *data, uint32_t dat_len,
				   int timeout_ms)
{
	uint32_t *tx_buf32 = (uint32_t *)data;
	uint32_t remain_len = dat_len;
	uint32_t chk_flg = (SDMMC_FLAG_TXUNDERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
			    SDMMC_FLAG_DATAEND);

	/* Fast path for 32-bit aligned data */
	if (((uintptr_t)data & 3) == 0) {
		while (!__SDMMC_GET_FLAG(sdmmc, chk_flg)) {
			if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_TXFIFOHE) && (remain_len >= 32U)) {
				for (size_t cnt = 0; cnt < 8; cnt++) {
					sdmmc->FIFO = *tx_buf32++;
				}
				remain_len -= 32U;
			} else if ((remain_len < 32U) && (remain_len > 0U)) {
				while (!__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_TXFIFOHE |
							 SDMMC_FLAG_TXFIFOE) &&
				       remain_len >= 4U) {
					sdmmc->FIFO = *tx_buf32++;
					remain_len -= 4U;
				}

				/* Handle remaining bytes */
				if (remain_len > 0U) {
					uint8_t *tx_buf8 = (uint8_t *)tx_buf32;
					uint32_t dat32 = 0U;
					for (size_t cnt = 0U; cnt < remain_len; cnt++) {
						dat32 |= ((uint32_t)(*tx_buf8) << (cnt << 3U));
						tx_buf8++;
					}
					sdmmc->FIFO = dat32;
				}
			}

			k_msleep(1);
			if (timeout_ms-- == 0) {
				return -ETIMEDOUT;
			}
		}
	} else {
		/* FIXME not yet support */
	}

	return 0;
}

static int sdhc_stm32_sdio_rw_extend(struct sdhc_stm32_data *ctx, struct sdhc_command *cmd,
				     const struct sdhc_data *data)
{
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;
	const struct device *dev = ctx->dev;
	const struct sdhc_stm32_config *cfg = dev->config;
	SDMMC_DataInitTypeDef config;
	uint32_t dir;
	uint32_t arg;
	uint32_t mode;
	uint32_t dat_len;
	uint32_t blk_sz;
	int ret;

	arg = cmd->arg;

	if (arg & BIT(SDIO_EXTEND_CMD_ARG_BLK_SHIFT)) {
		dat_len = (uint32_t)(data->blocks * data->block_size);
		blk_sz = sdhc_stm32_cnv_blk_sz(data->block_size);
		mode = SDMMC_TRANSFER_MODE_BLOCK;
	} else {
		dat_len = data->block_size;
		blk_sz = SDMMC_DATABLOCK_SIZE_1B;
		mode = SDMMC_TRANSFER_MODE_SDIO;
	}

	if (arg & BIT(SDIO_CMD_ARG_RW_SHIFT)) {
		dir = SDMMC_TRANSFER_DIR_TO_CARD;
	} else {
		dir = SDMMC_TRANSFER_DIR_TO_SDMMC;
	}

	if ((sdmmc->DCTRL & SDMMC_DCTRL_SDIOEN) != 0U) {
		sdmmc->DCTRL = SDMMC_DCTRL_SDIOEN;
	} else {
		sdmmc->DCTRL = 0U;
	}

	/* Configure the SD DPSM (Data Path State Machine) */
	config.DataTimeOut   = SDMMC_DATATIMEOUT;
	config.DataLength    = dat_len;
	config.DataBlockSize = blk_sz;
	config.TransferDir   = dir;
	config.TransferMode  = mode;
	config.DPSM          = SDMMC_DPSM_DISABLE;
	(void)SDMMC_ConfigData(ctx->sdmmc, &config);

	__SDMMC_CMDTRANS_ENABLE(sdmmc);

	ret = sdhc_stm32_snd_cmd(sdmmc, cmd, SDMMC_RESPONSE_SHORT);
	if (ret) {
		return -EIO;
	}

	if (cfg->use_dma) {
		/* @todo */
	} else {
		if (arg & BIT(SDIO_CMD_ARG_RW_SHIFT)) {
			ret = sdhc_stm32_sdio_wr_fifo(sdmmc, data->data, dat_len, data->timeout_ms);
		} else {
			ret = sdhc_stm32_sdio_rd_fifo(sdmmc, data->data, dat_len, data->timeout_ms);
		}

		__SDMMC_CMDTRANS_DISABLE(sdmmc);

		/* Clear all the static flags */
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_DATA_FLAGS);
	}

	return ret;
}

static void sdhc_stm32_cfg_data(SDMMC_TypeDef *sdmmc, uint32_t dat_len, uint32_t blk_sz,
				uint32_t dir, uint8_t dpsm)
{
	SDMMC_DataInitTypeDef config;

	/* Initialize data control register */
	sdmmc->DCTRL = 0U;

	/* Configure the SD DPSM (Data Path State Machine) */
	config.DataTimeOut   = SDMMC_DATATIMEOUT;
	config.DataLength    = dat_len;
	config.DataBlockSize = blk_sz;
	config.TransferDir   = dir;
	config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
	config.DPSM          = dpsm;
	(void)SDMMC_ConfigData(sdmmc, &config);

	if (dpsm == SDMMC_DPSM_DISABLE) {
		__SDMMC_CMDTRANS_ENABLE(sdmmc);
	}
}

static inline void sdhc_stm32_idma_setup(SDMMC_TypeDef *sdmmc, uint8_t *data)
{
	#if defined(CONFIG_SOC_SERIES_STM32H7X)
	sdmmc->IDMABASE0 = (uint32_t)data;
	#elif defined(CONFIG_SOC_SERIES_STM32H5X)
	sdmmc->IDMABASER = (uint32_t)data;
	#else
	#error "Unsupported STM32 series"
	#endif

	sdmmc->IDMACTRL = SDMMC_ENABLE_IDMA_SINGLE_BUFF;
}

static int sdhc_stm32_sdmmc_read_blocks(struct sdhc_stm32_data *ctx,
					struct sdhc_command *cmd, struct sdhc_data *data)
{
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;
	int ret;

	if (cmd->opcode == SD_READ_SINGLE_BLOCK) {
		ctx->xfer_ctx = SD_CONTEXT_READ_SINGLE_BLOCK;
	} else {
		ctx->xfer_ctx = SD_CONTEXT_READ_MULTIPLE_BLOCK;
	}

	ctx->rx_buffer  = data->data;
	ctx->rx_xfer_sz = (data->blocks * BLOCKSIZE);
	sdhc_stm32_cfg_data(sdmmc, ctx->rx_xfer_sz, SDMMC_DATABLOCK_SIZE_512B,
			    SDMMC_TRANSFER_DIR_TO_SDMMC, SDMMC_DPSM_DISABLE);
	if (ctx->use_dma) {
		sdhc_stm32_idma_setup(sdmmc, ctx->rx_buffer);
		ctx->xfer_ctx |= SD_CONTEXT_DMA;
	} else {
		ctx->xfer_ctx |= SD_CONTEXT_IT;
	}

	ret = sdhc_stm32_snd_cmd(sdmmc, cmd, SDMMC_RESPONSE_SHORT);
	if (ret == 0) {
		uint32_t int_flags = (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
				      SDMMC_IT_RXOVERR  | SDMMC_IT_DATAEND);
		if (ctx->use_dma) {
			__SDMMC_ENABLE_IT(sdmmc, int_flags);
		} else {
			__SDMMC_ENABLE_IT(sdmmc, int_flags | SDMMC_FLAG_RXFIFOHF);
		}

		ret = k_sem_take(&ctx->sync, K_MSEC(cmd->timeout_ms));
	}

	return ret;
}

static int sdhc_stm32_sdmmc_write_blocks(struct sdhc_stm32_data *ctx,
					 struct sdhc_command *cmd, struct sdhc_data *data)
{
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;
	int ret;

	if (cmd->opcode == SD_WRITE_SINGLE_BLOCK) {
		ctx->xfer_ctx = SD_CONTEXT_WRITE_SINGLE_BLOCK;
	} else {
		ctx->xfer_ctx = SD_CONTEXT_WRITE_MULTIPLE_BLOCK;
	}

	ctx->tx_buffer  = data->data;
	ctx->tx_xfer_sz = (data->blocks * BLOCKSIZE);
	sdhc_stm32_cfg_data(sdmmc, ctx->tx_xfer_sz, SDMMC_DATABLOCK_SIZE_512B,
			    SDMMC_TRANSFER_DIR_TO_CARD, SDMMC_DPSM_DISABLE);

	if (ctx->use_dma) {
		sdhc_stm32_idma_setup(sdmmc, ctx->tx_buffer);
		ctx->xfer_ctx |= SD_CONTEXT_DMA;
	} else {
		ctx->xfer_ctx |= SD_CONTEXT_IT;
	}

	ret = sdhc_stm32_snd_cmd(sdmmc, cmd, SDMMC_RESPONSE_SHORT);
	if (ret == 0) {
		uint32_t int_flags = (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
				      SDMMC_IT_TXUNDERR | SDMMC_IT_DATAEND);
		if (ctx->use_dma) {
			__SDMMC_ENABLE_IT(sdmmc, int_flags);
		} else {
			__SDMMC_ENABLE_IT(sdmmc, int_flags | SDMMC_FLAG_TXFIFOHE);
		}

		ret = k_sem_take(&ctx->sync, K_MSEC(cmd->timeout_ms));
	}

	return ret;
}

