ndrs-pst/zephyr_rtos/drivers/sdhc/sdhc_stm32_v2.c
static int sdhc_stm32_reset(const struct device *dev)
{
	const struct sdhc_stm32_config *cfg = dev->config;
	struct sdhc_stm32_data *ctx = dev->data;
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;
	int ret;

	/* Do card cycle power process */
	ret = reset_line_toggle_dt(&cfg->reset);
	if (ret) {
		LOG_ERR("Failed to reset peripheral");
		return ret;
	}

	(void)SDMMC_PowerState_Cycle(sdmmc);
	k_sleep(K_MSEC(1));
	(void)SDMMC_PowerState_OFF(sdmmc);
	k_sleep(K_MSEC(1));
	(void)SDMMC_PowerState_ON(sdmmc);

	return 0;
}

#if CONFIG_SDHC_STM32_HWFC_V2
static void sdhc_stm32_fc_enable(SDMMC_TypeDef *sdmmc)
{
	sdmmc->CLKCR |= SDMMC_CLKCR_HWFC_EN;
}
#endif

static void sdhc_stm32_read_it(struct sdhc_stm32_data *ctx, const SDMMC_TypeDef *sdmmc)
{
	uint32_t count;
	uint32_t data;
	uint8_t *tmp;

	tmp = ctx->rx_buffer;

	if (ctx->rx_xfer_sz >= SDMMC_FIFO_SIZE) {
		/* Read data from SDMMC Rx FIFO */
		for (count = 0U; count < (SDMMC_FIFO_SIZE / 4U); count++) {
			data = sdmmc->FIFO;
			*tmp = (uint8_t)(data & 0xFFU);
			tmp++;
			*tmp = (uint8_t)((data >> 8U) & 0xFFU);
			tmp++;
			*tmp = (uint8_t)((data >> 16U) & 0xFFU);
			tmp++;
			*tmp = (uint8_t)((data >> 24U) & 0xFFU);
			tmp++;
		}

		ctx->rx_buffer = tmp;
		ctx->rx_xfer_sz -= SDMMC_FIFO_SIZE;
	}

	if (ctx->rx_xfer_sz == 0U) {
		ctx->opr_cnt++;
	}
}

static void sdhc_stm32_write_it(struct sdhc_stm32_data *ctx, SDMMC_TypeDef *sdmmc) {
	uint32_t count;
	uint32_t data;
	uint8_t *tmp;

	tmp = ctx->tx_buffer;

	if (ctx->tx_xfer_sz >= SDMMC_FIFO_SIZE) {
		/* Write data to SDMMC Tx FIFO */
		for (count = 0U; count < (SDMMC_FIFO_SIZE / 4U); count++) {
			data = (uint32_t)(*tmp);
			tmp++;
			data |= ((uint32_t)(*tmp) << 8U);
			tmp++;
			data |= ((uint32_t)(*tmp) << 16U);
			tmp++;
			data |= ((uint32_t)(*tmp) << 24U);
			tmp++;
			sdmmc->FIFO = data;
		}

		ctx->tx_buffer = tmp;
		ctx->tx_xfer_sz -= SDMMC_FIFO_SIZE;
	}
}

static void sdhc_stm32_isr(const struct device *dev)
{
	struct sdhc_stm32_data *ctx = dev->data;
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;
	uint32_t xfer_ctx = ctx->xfer_ctx;
	uint32_t err_state;
	uint32_t flags;

	DBG_PIN_SET(0, 1);

	/* @see HAL_SDIO_IRQHandler */
	flags = sdmmc->STA;
	if ((flags & SDMMC_FLAG_SDIOIT) != 0U) {
		(void)k_work_submit(&ctx->sdio_work);
	}

	if (((flags & SDMMC_FLAG_RXFIFOHF) != 0U) && ((xfer_ctx & SD_CONTEXT_IT) != 0U)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_RXFIFOHF);

		DBG_PIN_SET(1, 1);
		sdhc_stm32_read_it(ctx, sdmmc);
		DBG_PIN_SET(1, 0);
	} else if ((flags & SDMMC_FLAG_DATAEND) != 0U) {
		DBG_PIN_SET(2, 1);
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_DATAEND);

		__SDMMC_DISABLE_IT(sdmmc, SDMMC_IT_DATAEND  | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT | \
				   SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR  | SDMMC_IT_TXFIFOHE | \
				   SDMMC_IT_RXFIFOHF);

		__SDMMC_DISABLE_IT(sdmmc, SDMMC_IT_IDMABTC);
		__SDMMC_CMDTRANS_DISABLE(sdmmc);

		if ((xfer_ctx & SD_CONTEXT_IT) != 0U) {
			/* Clear all the static flags */
			__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_DATA_FLAGS);
		} else { /* SD_CONTEXT_DMA */
			sdmmc->DLEN     = 0;
			sdmmc->DCTRL    = 0;
			sdmmc->IDMACTRL = SDMMC_DISABLE_IDMA;
		}

		ctx->ops_sts = SDMMC_ERROR_NONE;
		if ((xfer_ctx & (SD_CONTEXT_READ_MULTIPLE_BLOCK | SD_CONTEXT_WRITE_MULTIPLE_BLOCK)) != 0U) {
			/* Stop Transfer for Write Multi blocks or Read Multi blocks */
			err_state = SDMMC_CmdStopTransfer(sdmmc);
			if (err_state != SDMMC_ERROR_NONE) {
				ctx->ops_sts = err_state;
			}
		}
		ctx->xfer_ctx = SD_CONTEXT_NONE;
		k_sem_give(&ctx->sync);

		DBG_PIN_SET(2, 0);
	} else if (((flags & SDMMC_FLAG_TXFIFOHE) != 0U) &&
		   ((xfer_ctx & SD_CONTEXT_IT) != 0U)) {
		DBG_PIN_SET(3, 1);
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_TXFIFOHE);
		sdhc_stm32_write_it(ctx, sdmmc);
		DBG_PIN_SET(3, 0);
	} else if ((flags & (SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
			     SDMMC_FLAG_RXOVERR  | SDMMC_FLAG_TXUNDERR)) != 0U) {
		DBG_PIN_SET(5, 1);
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_STATIC_DATA_FLAGS);

		__SDMMC_DISABLE_IT(sdmmc, (SDMMC_IT_DATAEND  | SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
					   SDMMC_IT_TXUNDERR | SDMMC_IT_RXOVERR));

		__SDMMC_CMDTRANS_DISABLE(sdmmc);

		sdmmc->DCTRL |= SDMMC_DCTRL_FIFORST;
		sdmmc->CMD   |= SDMMC_CMD_CMDSTOP;
		SDMMC_CmdStopTransfer(sdmmc);
		sdmmc->CMD   &= ~(SDMMC_CMD_CMDSTOP);
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_DABORT);

		if ((xfer_ctx & SD_CONTEXT_IT) != 0U) {
			ctx->xfer_ctx = SD_CONTEXT_NONE;
		}
		else { /* SD_CONTEXT_DMA */
			__SDMMC_DISABLE_IT(sdmmc, SDMMC_IT_IDMABTC);
			sdmmc->IDMACTRL = SDMMC_DISABLE_IDMA;
		}

		/* @see SDMMC_LL_Exported_Constants */
		ctx->ops_sts = flags & (SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT |
					SDMMC_FLAG_RXOVERR  | SDMMC_FLAG_TXUNDERR);
		k_sem_give(&ctx->sync);
		DBG_PIN_SET(5, 0);
	} else if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_IDMABTC)) {
		__SDMMC_CLEAR_FLAG(sdmmc, SDMMC_FLAG_IDMABTC);

		if ((xfer_ctx & SD_CONTEXT_WRITE_MULTIPLE_BLOCK) != 0U) {
			/* HAL_SDEx_Write_DMALnkLstBufCpltCallback(hsd); */
		}
		else { /* SD_CONTEXT_READ_MULTIPLE_BLOCK */
			/* HAL_SDEx_Read_DMALnkLstBufCpltCallback */
		}

		k_sem_give(&ctx->sync);
	} else {
		/* Nothing to do */
	}

	DBG_PIN_SET(0, 0);
}

/*
 * Set SDHC io properties @see sdhc_esp32_set_io, imx_usdhc_set_io
 */
static int sdhc_stm32_set_io(const struct device *dev, struct sdhc_io *ios)
{
	const struct sdhc_stm32_config *cfg = dev->config;
	struct sdhc_stm32_data *ctx = dev->data;
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;
	struct sdhc_io *host_io = &ctx->host_io;

	LOG_INF("SDHC I/O: bus width %d, clock %dHz, card power %s, voltage %s",
		ios->bus_width, ios->clock,
		ios->power_mode == SDHC_POWER_ON ? "ON" : "OFF",
		ios->signal_voltage == SD_VOL_1_8_V ? "1.8V" : "3.3V");

	if ((host_io->clock != ios->clock) && (ios->clock != 0)) {
		uint32_t sdmmc_ker_ck;
		uint32_t clk_div;
		const struct device *clock;

		clock = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
		if (clock_control_get_rate(clock, (clock_control_subsys_t)&cfg->pclken[1],
					   &sdmmc_ker_ck) != 0) {
			LOG_ERR("Failed to get SDMMC domain clock rate");
			return -EIO;
		}

		if (((unsigned int)ios->clock > cfg->props.f_max) ||
		    ((unsigned int)ios->clock < cfg->props.f_min)) {
			return -EINVAL;
		}

		/* clk_div is equal to [sdmmc_ker_ck / (2 * SDMMC_CK)] */
		clk_div = sdmmc_ker_ck / (2U * (uint32_t)ios->clock);
		if (clk_div > 0) {
			MODIFY_REG(sdmmc->CLKCR, SDMMC_CLKCR_CLKDIV, clk_div);
		} else {
			return -EINVAL;
		}

