ndrs-pst/zephyr_rtos/drivers/sdhc/sdhc_stm32_v2.c
		host_io->clock = ios->clock;
	}

	if (host_io->bus_width != ios->bus_width) {
		uint32_t bus_wide;

		switch (ios->bus_width) {
		case SDHC_BUS_WIDTH1BIT:
			bus_wide = SDMMC_BUS_WIDE_1B;
			break;

		case SDHC_BUS_WIDTH4BIT:
			bus_wide = SDMMC_BUS_WIDE_4B;
			break;

		default: /* SDHC_BUS_WIDTH8BIT */
			bus_wide = SDMMC_BUS_WIDE_8B;
			break;
		}

		MODIFY_REG(sdmmc->CLKCR, SDMMC_CLKCR_WIDBUS, bus_wide);
		host_io->bus_width = ios->bus_width;
	}

	if (ios->signal_voltage != host_io->signal_voltage) {
		/* Switch to 1.8V */
		if (ios->signal_voltage == SD_VOL_1_8_V) {
			/* Enable 1.8V signal voltage */
			/* @todo */
		} else {
			/* Switch to 3.3V */
			/* Disable 1.8V signal voltage */
			/* @todo */
		}

		host_io->signal_voltage = ios->signal_voltage;
	}

	/* Toggle card power supply */
	if ((host_io->power_mode != ios->power_mode) && cfg->pwr_gpio.port) {
		if (ios->power_mode == SDHC_POWER_OFF) {
			gpio_pin_set_dt(&cfg->pwr_gpio, 0);
		} else { /* SDHC_POWER_ON */
			gpio_pin_set_dt(&cfg->pwr_gpio, 1);
		}

		host_io->power_mode = ios->power_mode;
	}

	/* Set I/O timing */
	if (host_io->timing != ios->timing) {
		switch (ios->timing) { /* HAL_SDIO_SetSpeedMode */
		case SDHC_TIMING_LEGACY:
		case SDHC_TIMING_HS:
		case SDHC_TIMING_SDR12:
		case SDHC_TIMING_SDR25:
			MODIFY_REG(sdmmc->CLKCR, (SDMMC_CLKCR_DDR | SDMMC_CLKCR_BUSSPEED), 0U);
			break;

		case SDHC_TIMING_SDR50:
		case SDHC_TIMING_SDR104:
		case SDHC_TIMING_HS200:
			MODIFY_REG(sdmmc->CLKCR, (SDMMC_CLKCR_DDR | SDMMC_CLKCR_BUSSPEED),
				   SDMMC_CLKCR_BUSSPEED);
			break;

		case SDHC_TIMING_DDR50:
			MODIFY_REG(sdmmc->CLKCR, (SDMMC_CLKCR_DDR | SDMMC_CLKCR_BUSSPEED),
				   (SDMMC_CLKCR_DDR | SDMMC_CLKCR_BUSSPEED));
			/* Enable DDR mode */
			LOG_INF("DDR mode enabled");
			break;

		default:
			LOG_ERR("Timing mode not supported for this device");
			return -ENOTSUP;
		}

		host_io->timing = ios->timing;
	}

	return 0;
}

/*
 * Return 0 if card is not busy, 1 if it is
 */
static int sdhc_stm32_card_busy(const struct device *dev)
{
	struct sdhc_stm32_data *ctx = dev->data;
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;

	if (__SDMMC_GET_FLAG(sdmmc, SDMMC_FLAG_BUSYD0)) {
		return 1;
	}
	return 0;
}

static int sdhc_stm32_req_ll(const struct device *dev, struct sdhc_command *cmd,
			     struct sdhc_data *data)
{
	struct sdhc_stm32_data *ctx = dev->data;
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;
	uint32_t err_state;
	int ret = 0;

	switch (cmd->opcode) {
	case SD_GO_IDLE_STATE:              /* SDMMC_CmdGoIdleState */
		ret = sdhc_stm32_snd_cmd(sdmmc, cmd, SDMMC_RESPONSE_NO);
		break;

	case SDIO_SEND_OP_COND:
		err_state = SDMMC_CmdSendOperationcondition(sdmmc, cmd->arg, cmd->response);
		if (err_state != HAL_SD_ERROR_NONE) {
			return -EIO;
		}
		break;

	case SD_ALL_SEND_CID:               /* SDMMC_CmdSendCID */
	case SD_SEND_CSD:                   /* SDMMC_CmdSendCSD */
		ret = sdhc_stm32_snd_cmd(sdmmc, cmd, SDMMC_RESPONSE_LONG);
		break;

	case MMC_SEND_OP_COND:              /* SDMMC_CmdOpCondition */
	case SDMMC_SEND_RELATIVE_ADDR:      /* SDMMC_CmdSetRelAdd */
	case SD_SELECT_CARD:                /* SDMMC_CmdSelDesel */
	case SD_SEND_IF_COND:               /* SDMMC_CmdSendEXTCSD */
	case SD_VOL_SWITCH:                 /* SDMMC_CmdVoltageSwitch */
	case SD_SEND_STATUS:                /* SDMMC_CmdSendStatus */
	case SD_SET_BLOCK_SIZE:             /* SDMMC_CmdBlockLength */
	case SD_APP_SEND_OP_COND:           /* SDMMC_CmdAppOperCommand */
	case SD_APP_CMD:                    /* SDMMC_CmdAppCommand */
		ret = sdhc_stm32_snd_cmd(sdmmc, cmd, SDMMC_RESPONSE_SHORT);
		break;

	case SDIO_RW_DIRECT: {              /* HAL_SDIO_ReadDirect, HAL_SDIO_WriteDirect */
		ret = sdhc_stm32_sdio_rw_direct(sdmmc, cmd);
		break;
	}

	case SDIO_RW_EXTENDED: {
		if (data != NULL) {
			ret = sdhc_stm32_sdio_rw_extend(ctx, cmd, data);
		} else {
			LOG_ERR("Data is NULL");
			ret = -EINVAL;
		}
		break;
	}

	case SD_READ_SINGLE_BLOCK:
	case SD_READ_MULTIPLE_BLOCK: {
		ret = sdhc_stm32_sdmmc_read_blocks(ctx, cmd, data);
		break;
	}

	case SD_SWITCH:                     /* SDMMC_CmdSwitch, share with SD_APP_SET_BUS_WIDTH */
		if (ctx->prev_opcode == SD_APP_CMD) {
			/* SD_APP_SET_BUS_WIDTH */
			ret = sdhc_stm32_snd_cmd(sdmmc, cmd, SDMMC_RESPONSE_SHORT);
		} else {
			ctx->rx_buffer  = data->data;
			ctx->rx_xfer_sz = data->blocks * data->block_size;
			sdhc_stm32_cfg_data(sdmmc, ctx->rx_xfer_sz, SDMMC_DATABLOCK_SIZE_64B,
					    SDMMC_TRANSFER_DIR_TO_SDMMC, SDMMC_DPSM_ENABLE);
			ret = sdhc_stm32_snd_cmd(sdmmc, cmd, SDMMC_RESPONSE_SHORT);
			if (ret == 0) {
				ret = sdhc_stm32_get_speed(sdmmc, cmd->timeout_ms, ctx->rx_buffer);
			}
		}
		break;

	case SD_APP_SEND_SCR:               /* SDMMC_CmdSendSCR */
		ctx->rx_buffer  = data->data;
		ctx->rx_xfer_sz = data->blocks * data->block_size;
		sdhc_stm32_cfg_data(sdmmc, ctx->rx_xfer_sz, SDMMC_DATABLOCK_SIZE_8B,
				    SDMMC_TRANSFER_DIR_TO_SDMMC, SDMMC_DPSM_ENABLE);
		ret = sdhc_stm32_snd_cmd(sdmmc, cmd, SDMMC_RESPONSE_SHORT);
		if (ret == 0) {
			ret = sdhc_stm32_get_scr(sdmmc, cmd->timeout_ms, ctx->rx_buffer);
		}
		break;

	case SD_APP_SEND_NUM_WRITTEN_BLK: {
		sdhc_stm32_cfg_data(sdmmc, 4, SDMMC_DATABLOCK_SIZE_4B,
				    SDMMC_TRANSFER_DIR_TO_SDMMC, SDMMC_DPSM_DISABLE);
		ret = sdhc_stm32_snd_cmd(sdmmc, cmd, SDMMC_RESPONSE_SHORT);
		if (ret == 0) {
			__SDMMC_ENABLE_IT(sdmmc, (SDMMC_IT_DCRCFAIL | SDMMC_IT_DTIMEOUT |
						  SDMMC_IT_RXOVERR  | SDMMC_IT_DATAEND |
						  SDMMC_FLAG_RXFIFOHF));
		}
		break;
	}

	case SD_WRITE_SINGLE_BLOCK:         /* SDMMC_CmdWriteSingleBlock */
	case SD_WRITE_MULTIPLE_BLOCK:       /* SDMMC_CMD_WRITE_MULT_BLOCK */
		ret = sdhc_stm32_sdmmc_write_blocks(ctx, cmd, data);
		break;

	case SD_STOP_TRANSMISSION:          /* SDMMC_CmdStopTransfer */
		ret = sdhc_stm32_stp_xfer(sdmmc, cmd);
		break;

	default:
		LOG_INF("SDHC driver: command %u not supported", cmd->opcode);
		return -ENOTSUP;
	}

	ctx->prev_opcode = cmd->opcode;

	return (ret);
}

static void sdhc_stm32_abort(const struct device *dev)
{
	struct sdhc_command cmd = {
		.opcode = SD_STOP_TRANSMISSION,
		.arg = 0,
		.response_type = SD_RSP_TYPE_R1b
	};

