ndrs-pst/zephyr_rtos/drivers/sdhc/sdhc_stm32_v2.c
	sdhc_stm32_req_ll(dev, &cmd, NULL);
}

/*
 * Send CMD or CMD/DATA via SDHC
 */
static int sdhc_stm32_request(const struct device *dev, struct sdhc_command *cmd,
			      struct sdhc_data *data)
{
	unsigned int retries = cmd->retries + 1;
	int busy_timeout = 5000;
	int ret;

	do {
		DBG_PIN_SET(4, 1);
		ret = sdhc_stm32_req_ll(dev, cmd, data);
		DBG_PIN_SET(4, 0);
		if (data && (ret || (data->blocks > 1))) {
			sdhc_stm32_abort(dev);
			while (busy_timeout > 0) {
				if (!sdhc_stm32_card_busy(dev)) {
					break;
				}
				k_busy_wait(125);
				busy_timeout -= 125;
			}

			if (busy_timeout <= 0) {
				LOG_ERR("Card did not idle after CMD12");
				ret = -ETIMEDOUT;
			}
		}

		retries--;
	} while ((ret != 0) && (retries > 0));

	return ret;
}

/*
 * Get card presence @see imx_usdhc_get_card_present
 */
static int sdhc_stm32_get_card_present(const struct device *dev)
{
	const struct sdhc_stm32_config *cfg = dev->config;
	struct sdhc_stm32_data *ctx = dev->data;

	if (cfg->cd_gpio.port) {
		ctx->card_present = gpio_pin_get_dt(&cfg->cd_gpio) > 0;
	} else {
		LOG_WRN("No card detection method configured, assuming card "
			"is present");
		ctx->card_present = true;
	}

	return ((int)ctx->card_present);
}

static void sdhc_stm32_card_detect_handler(struct k_work *item)
{
	struct sdhc_stm32_data *ctx = CONTAINER_OF(item,
						   struct sdhc_stm32_data,
						   cd_work);
	const struct device *dev = ctx->dev;
	int int_sources;

	if (sdhc_stm32_get_card_present(ctx->dev)) {
		LOG_DBG("card inserted");
		ctx->card_sts = DISK_STATUS_UNINIT;
		int_sources = SDHC_INT_INSERTED;

	} else {
		LOG_DBG("card removed");
		ctx->card_sts = DISK_STATUS_NOMEDIA;
		int_sources = SDHC_INT_REMOVED;
	}

	if (ctx->sdhc_cb != NULL) {
		ctx->sdhc_cb(dev, int_sources, ctx->sdhc_cb_user_data);
	}
}

static void sdhc_stm32_card_detect_callback(const struct device *gpiodev,
					    struct gpio_callback *cb,
					    uint32_t pin)
{
	struct sdhc_stm32_data *ctx = CONTAINER_OF(cb,
						    struct sdhc_stm32_data,
						    cd_cb);

	k_work_submit(&ctx->cd_work);
}

static int sdhc_stm32_card_detect_init(const struct device *dev)
{
	const struct sdhc_stm32_config *cfg = dev->config;
	struct sdhc_stm32_data *ctx = dev->data;
	int err;

	if (!cfg->cd_gpio.port) {
		return 0;
	}

	if (!gpio_is_ready_dt(&cfg->cd_gpio)) {
		return -ENODEV;
	}

	gpio_init_callback(&ctx->cd_cb, sdhc_stm32_card_detect_callback,
			   (1 << cfg->cd_gpio.pin));

	err = gpio_add_callback(cfg->cd_gpio.port, &ctx->cd_cb);
	if (err) {
		return err;
	}

	err = gpio_pin_configure_dt(&cfg->cd_gpio, GPIO_INPUT);
	if (err) {
		goto remove_callback;
	}

	err = gpio_pin_interrupt_configure_dt(&cfg->cd_gpio, GPIO_INT_EDGE_BOTH);
	if (err) {
		goto unconfigure_pin;
	}
	return 0;

unconfigure_pin:
	gpio_pin_configure_dt(&cfg->cd_gpio, GPIO_DISCONNECTED);

remove_callback:
	gpio_remove_callback(cfg->cd_gpio.port, &ctx->cd_cb);

	return err;
}

static int sdhc_stm32_card_detect_uninit(const struct device *dev)
{
	const struct sdhc_stm32_config *cfg = dev->config;
	struct sdhc_stm32_data *ctx = dev->data;

	if (!cfg->cd_gpio.port) {
		return 0;
	}

	gpio_pin_interrupt_configure_dt(&cfg->cd_gpio, GPIO_INT_MODE_DISABLED);
	gpio_pin_configure_dt(&cfg->cd_gpio, GPIO_DISCONNECTED);
	gpio_remove_callback(cfg->cd_gpio.port, &ctx->cd_cb);

	return 0;
}

static int sdhc_stm32_pwr_init(const struct sdhc_stm32_config *cfg)
{
	int err;

	if (!cfg->pwr_gpio.port) {
		return 0;
	}

	if (!gpio_is_ready_dt(&cfg->pwr_gpio)) {
		return -ENODEV;
	}

	err = gpio_pin_configure_dt(&cfg->pwr_gpio, GPIO_OUTPUT_ACTIVE);
	if (err) {
		return err;
	}

	k_sleep(K_MSEC(50));

	return 0;
}

static int sdhc_stm32_pwr_uninit(const struct sdhc_stm32_config *cfg)
{
	if (!cfg->pwr_gpio.port) {
		return 0;
	}

	gpio_pin_configure_dt(&cfg->pwr_gpio, GPIO_DISCONNECTED);
	return 0;
}

/*
 * Get host properties
 */
static int sdhc_stm32_get_host_props(const struct device *dev,
				     struct sdhc_host_props *props) /* SD_INIT_SEQ02 */
{
	const struct sdhc_stm32_config *cfg = dev->config;

	memcpy(props, &cfg->props, sizeof(struct sdhc_host_props));

	return 0;
}

static int sdhc_stm32_enable_interrupt(const struct device *dev,
				       sdhc_interrupt_cb_t callback,
				       int sources, void *user_data)
{
	struct sdhc_stm32_config const* cfg = dev->config;
	struct sdhc_stm32_data *ctx = dev->data;
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;
	int ret = 0;

	/* Record SDIO callback parameters */
	ctx->sdhc_cb = callback;
	ctx->sdhc_cb_user_data = user_data;
	ctx->sdhc_int_sources = sources;

	if (sources & SDHC_INT_SDIO) {
		/* Enable SDIO interrupt */
		sdmmc->DCTRL = SDMMC_DCTRL_SDIOEN;
	}

	if (sources & SDHC_INT_INSERTED) {
		/* Enable card detection interrupt */
		if (cfg->cd_gpio.port) {
			ret = gpio_pin_interrupt_configure_dt(&cfg->cd_gpio,
							      GPIO_INT_EDGE_RISING);
			if (ret) {
				return ret;
			}
		}
	}

	if (sources & SDHC_INT_REMOVED) {
		/* Enable card removal interrupt */
		if (cfg->cd_gpio.port) {
			ret = gpio_pin_interrupt_configure_dt(&cfg->cd_gpio,
							      GPIO_INT_EDGE_FALLING);
			if (ret) {
				return ret;
			}
		}
	}

	return ret;
}

static int sdhc_stm32_disable_interrupt(const struct device *dev, int sources)
{
	struct sdhc_stm32_config const* cfg = dev->config;
	struct sdhc_stm32_data *ctx = dev->data;
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;
	int ret = 0;

	ctx->sdhc_int_sources &= ~sources;

	if (sources & SDHC_INT_SDIO) {
		/* Disable SDIO interrupt */
		sdmmc->DCTRL = 0;
	}

	if (sources & SDHC_INT_INSERTED) {
		/* Disable card detection interrupt */
		if (cfg->cd_gpio.port) {
			ret = gpio_pin_interrupt_configure_dt(&cfg->cd_gpio,
							      GPIO_INT_DISABLE);
			if (ret) {
				return ret;
			}
		}
	}

	if (sources & SDHC_INT_REMOVED) {
		/* Disable card removal interrupt */
		if (cfg->cd_gpio.port) {
			ret = gpio_pin_interrupt_configure_dt(&cfg->cd_gpio,
							      GPIO_INT_DISABLE);
			if (ret) {
				return ret;
			}
		}
	}

	/* If all interrupt flags are disabled, remove callback */
	if (ctx->sdhc_int_sources == 0) {
		ctx->sdhc_cb = NULL;
		ctx->sdhc_cb_user_data = NULL;
	}

	return ret;
}

