ndrs-pst/zephyr_rtos/drivers/sdhc/sdhc_stm32_v2.c
static void sdhc_stm32_sdio_work_handler(struct k_work *work)
{
	struct sdhc_stm32_data *ctx = CONTAINER_OF(work, struct sdhc_stm32_data, sdio_work);

	if (ctx->sdhc_cb != NULL) {
		ctx->sdhc_cb(ctx->dev, SDHC_INT_SDIO, ctx->sdhc_cb_user_data);
	}
}

static int sdhc_stm32_registers_configure(const struct device *dev)
{
	const struct sdhc_stm32_config *cfg = dev->config;
	struct sdhc_stm32_data const *ctx = dev->data;
	SDMMC_TypeDef *sdmmc = ctx->sdmmc;
	const struct device *clock;
	SDMMC_InitTypeDef Init;
	uint32_t sdmmc_ker_ck;
	int ret;

	if (!device_is_ready(cfg->reset.dev)) {
		LOG_ERR("Reset controller not ready");
		return -ENODEV;
	}

	ret = reset_line_toggle_dt(&cfg->reset);
	if (ret) {
		LOG_ERR("Failed to reset peripheral");
		return ret;
	}

	clock = DEVICE_DT_GET(STM32_CLOCK_CONTROL_NODE);
	if (clock_control_get_rate(clock, (clock_control_subsys_t)&cfg->pclken[1],
				   &sdmmc_ker_ck) != 0) {
		LOG_ERR("Failed to get SDMMC domain clock rate");
		return -EIO;
	}

	Init.ClockEdge           = SDMMC_CLOCK_EDGE_RISING;
	Init.ClockPowerSave      = SDMMC_CLOCK_POWER_SAVE_DISABLE;
	Init.BusWide             = SDMMC_BUS_WIDE_1B;
	Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
	Init.ClockDiv            = sdmmc_ker_ck / (2U * SDMMC_CLOCK_400KHZ);
	(void)SDMMC_Init(sdmmc, Init);

	(void)SDMMC_PowerState_ON(sdmmc);

	return ret;
}

/*
 * Perform early system init for SDHC
 * @see disk_stm32_sdmmc_init
 */
static int sdhc_stm32_init(const struct device *dev)
{
	const struct sdhc_stm32_config *cfg = dev->config;
	struct sdhc_stm32_data *ctx = dev->data;
	int ret;

	ret = sdhc_stm32_clock_enable(cfg);
	if (ret) {
		LOG_ERR("Failed to init clocks");
		return ret;
	}

	ret = pinctrl_apply_state(cfg->pcfg, PINCTRL_STATE_DEFAULT);
	if (ret < 0) {
		LOG_ERR("Failed to configure SDHC pins");
		return -EINVAL;
	}

	ctx->dev = dev;
	ctx->use_dma = cfg->use_dma;
	cfg->irq_config(dev);

	k_sem_init(&ctx->sync, 0, 1);
	k_work_init(&ctx->cd_work, sdhc_stm32_card_detect_handler);
	ret = sdhc_stm32_card_detect_init(dev);
	if (ret) {
		return ret;
	}

	ret = sdhc_stm32_pwr_init(cfg);
	if (ret) {
		goto err_card_detect;
	}

	ret = sdhc_stm32_registers_configure(dev);
	if (ret) {
		goto err_pwr;
	}

#if STM32_SDHC_USE_DMA
	err = sdhc_stm32_dma_init(ctx);
	if (err) {
		LOG_ERR("DMA init failed");
		return err;
	}
#endif

#ifdef CONFIG_SDHC_STM32_HWFC_V2
	sdhc_stm32_fc_enable(ctx->sdmmc);
#endif

	/* Set all host IO values to zeroes */
	memset(&ctx->host_io, 0, sizeof(struct sdhc_io));
	k_work_init(&ctx->sdio_work, sdhc_stm32_sdio_work_handler);

	return 0;

err_pwr:
	sdhc_stm32_pwr_uninit(cfg);

err_card_detect:
	sdhc_stm32_card_detect_uninit(dev);

	sdhc_stm32_clock_disable(cfg);

	return ret;
}

#define STM32_SDHC_IRQ_HANDLER(n)                                                                  \
	static void sdhc_stm32_irq_config_func_##n(const struct device *dev)                       \
	{                                                                                          \
		IRQ_CONNECT(DT_INST_IRQN(n), DT_INST_IRQ(n, priority), sdhc_stm32_isr,             \
			    DEVICE_DT_INST_GET(n), 0);                                             \
		irq_enable(DT_INST_IRQN(n));                                                       \
	}

static DEVICE_API(sdhc, sdhc_stm32_api) = {
	.reset = sdhc_stm32_reset,
	.request = sdhc_stm32_request,
	.set_io = sdhc_stm32_set_io,
	.get_card_present = sdhc_stm32_get_card_present,
	.card_busy = sdhc_stm32_card_busy,
	.get_host_props = sdhc_stm32_get_host_props,
	.enable_interrupt = sdhc_stm32_enable_interrupt,
	.disable_interrupt = sdhc_stm32_disable_interrupt,
};

#define SDHC_STM32_INIT(n)                                                                         \
                                                                                                   \
	STM32_SDHC_IRQ_HANDLER(n);                                                                 \
	static const struct stm32_pclken pclken_##n[] = STM32_DT_INST_CLOCKS(n);                   \
	PINCTRL_DT_DEFINE(DT_DRV_INST(n));                                                         \
                                                                                                   \
	static const struct sdhc_stm32_config sdhc_stm32_##n##_config = {                          \
		.irq_config = sdhc_stm32_irq_config_func_##n,                                      \
		.pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(n),                                         \
		.pclken = pclken_##n,                                                              \
		.pclk_len = DT_INST_NUM_CLOCKS(n),                                                 \
		.cd_gpio = GPIO_DT_SPEC_INST_GET_OR(n, cd_gpios, {0}),                             \
		.pwr_gpio = GPIO_DT_SPEC_INST_GET_OR(n, pwr_gpios, {0}),                           \
		.reset = RESET_DT_SPEC_INST_GET(n),                                                \
		.use_dma = DT_INST_PROP(n, idma),                                                  \
		.props = {                                                                         \
			.f_max = DT_INST_PROP(n, max_bus_freq),                                    \
			.f_min = DT_INST_PROP(n, min_bus_freq),                                    \
			.max_current_330 = DT_INST_PROP(n, max_current_330),                       \
			.max_current_180 = DT_INST_PROP(n, max_current_180),                       \
			.power_delay = DT_INST_PROP_OR(n, power_delay_ms, 0),                      \
			.bus_4_bit_support =                                                       \
				(DT_INST_PROP(n, bus_width) == 4) ? true : false,                  \
			.hs200_support = true,                                                     \
			.hs400_support = false,                                                    \
			.is_spi = false,                                                           \
			.host_caps = {                                                             \
				.vol_180_support = false,                                          \
				.vol_300_support = false,                                          \
				.vol_330_support = true,                                           \
				.suspend_res_support = false,                                      \
				.sdma_support = true,                                              \
				.high_spd_support =                                                \
					(DT_INST_PROP(n, bus_width) == 4) ? true : false,          \
				.adma_2_support = false,                                           \
				.max_blk_len = 0,                                                  \
				.ddr50_support = true,                                             \
				.sdr104_support = true,                                            \
				.sdr50_support = true,                                             \
				.bus_8_bit_support = false                                         \
			}                                                                          \
		}                                                                                  \
	};                                                                                         \
                                                                                                   \
	static struct sdhc_stm32_data sdhc_stm32_##n##_data = {                                    \
		.sdmmc = (SDMMC_TypeDef *)DT_REG_ADDR(DT_DRV_INST(n)),                             \
	};                                                                                         \
                                                                                                   \
	DEVICE_DT_INST_DEFINE(n, sdhc_stm32_init, NULL, &sdhc_stm32_##n##_data,                    \
			      &sdhc_stm32_##n##_config, POST_KERNEL, CONFIG_SDHC_INIT_PRIORITY,    \
			      &sdhc_stm32_api);

DT_INST_FOREACH_STATUS_OKAY(SDHC_STM32_INIT)
